КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/СостоянияИРеквизитыДоставки/СостоянияИРеквизитыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a868ca92-056a-4d0a-9f81-cc25dea4689c">
  <name>СостоянияИРеквизитыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="4b8c4a32-452b-431e-9ba6-e6fa9ee5dc8f">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="16537153-fd12-4040-86a7-4bb183c97956">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a2515e3f-e33c-47d8-a4f8-42ba1311b2dc">
    <name>ДоставитьПолностью</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="3e564b1d-32c6-4e35-9a58-ff82d0fd12cb">
    <name>АдресЗначенияПолей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd68befe-2334-4d95-8c5a-a5c3f5c6dae7">
    <name>ВремяС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0952911e-4115-4fc1-8161-ec8d869b6e22">
    <name>ВремяПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e50733ba-8c2b-43f4-8b6b-f08aba09426f">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a34c5373-d556-4306-9808-d83683aed4be">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2d03338-d318-44c2-9fee-f97621d48919">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24629c7a-2abc-4adb-a4d4-902c71d7a2f7">
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e66d78d-cd8d-4564-8d21-81662a1b2074">
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="87e51901-d207-4011-b41b-632ba0fc6a2d">
    <name>РазбиватьРасходныеОрдераПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="29a20d1e-315f-455e-8d43-502dae4f474d">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="57331f56-a991-4c76-b1d7-3247bbfa242f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="282e3d2c-3a88-4cf3-af5b-3714e1dae3c9">
    <name>ПолучательОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1813e264-2d40-46be-a153-33cdcb2afbc1">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f6c04ea1-ba45-4ee9-bcab-d0e6ee33f03d">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="be7fb96b-cc04-4619-a713-d62235916a69">
    <name>Зона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/ДополнительнаяИнформацияПоДоставке/ДополнительнаяИнформацияПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительнаяИнформацияПоДоставке</name>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </resources>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="98432b29-54a0-461b-8949-90d8b093d361">
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="280f7296-5e90-4427-8283-20b46e71e378">
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f416de4c-0e65-4c7a-ac1b-6006787f8f96">
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f9e83d06-ca35-4604-8a3b-7763e3d4f9e8">
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f05a8baa-f36f-47cf-b83c-fdc47a0c74e5">
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ВидыДоставки/ВидыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b5ed99b2-7924-4203-a775-513d82ad12f3">
  <name>ВидыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="7d4255ab-af6b-402e-a3ad-e6d0703bb735">
    <name>НаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5d97dd16-48c2-4724-8773-9b2adf8c2fa5">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/CommonModules/ДоставкаТоваров/Module.bsl
Функция ЗонаСуществует(п_Зона, п_КоллекцияКорневыхУзлов)

	Для каждого Т Из п_КоллекцияКорневыхУзлов Цикл
		Если п_Зона = Т.Зона Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;	

КонецФункции // ()

Функция СтрокаСуществует(п_Распоряжение, п_КоллекцияУзлов)

	Для каждого Т Из п_КоллекцияУзлов Цикл
		Если п_Распоряжение = Т.Распоряжение Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;	

КонецФункции // ()

Функция ПолучитьЗаявкиНаВозвратТоваровОтКлиента(п_Склад, п_ДатаРаспоряжений)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
		|	ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.ПолучательОтправитель) КАК ПолучательОтправительПредставление,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер КАК Номер,
		|	РаспоряженияНаДоставку.Дата КАК Дата,
		|	РаспоряженияНаДоставку.Зона КАК Зона,
		|	РаспоряженияНаДоставку.Адрес КАК Адрес,
		|	РаспоряженияНаДоставку.ВремяС КАК ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|ГДЕ
		|	РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада)
		|	И РаспоряженияНаДоставку.Дата >= &ДатаРаспоряжений
		|	И РаспоряженияНаДоставку.Склад В ИЕРАРХИИ(&Склад)
		|	И РаспоряженияНаДоставку.Распоряжение ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента";
	
	Запрос.УстановитьПараметр("Склад", п_Склад);
	Запрос.УстановитьПараметр("ДатаРаспоряжений", п_ДатаРаспоряжений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Рез = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Распоряжение = Новый Структура(
						"Распоряжение,
						| Склад, 
						| ПолучательОтправитель,
						| ПолучательОтправительПредставление,
						| Контакты,
						| ВидРаспоряжения,
						| Номер,
						| Дата,
						| Зона,
						| Адрес,
						| ВремяС,
						| ВремяПо,
						| Вес,
						| Объем,
						| ДополнительнаяИнформация");
		ЗаполнитьЗначенияСвойств(Распоряжение, Выборка);
		
		ВесОбъем = ОД_ОбщиеФункции.ПолучитьВесОбъемДляДокумента(Выборка.Распоряжение);
		
		Распоряжение.Вес	= ВесОбъем.Вес;
		Распоряжение.Объем	= ВесОбъем.Объем;
		
		Рез.Добавить(Распоряжение);
	КонецЦикла;

	Возврат Рез;
	
КонецФункции // ()

&Вместо("ОбновитьСписокРаспоряженийНаДоставку")
Процедура ОД_ОбновитьСписокРаспоряженийНаДоставку(Форма, ОбновляемыеРаспоряжения)
	ДопустимоеОтклонениеПроцент = Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
	
	РаспоряженияНаДоставку 		= Форма.РаспоряженияНаДоставку;
	ТоварыРаспоряженийКДоставке = Форма.ТоварыРаспоряженийКДоставке;
	ОтборПоТипуИсполнителей 	= Форма.ОтборПоТипуИсполнителей;
	Зона 						= Форма.Зона;
	Склад 						= Форма.Склад;
	ДатаРаспоряжений 			= Форма.ДатаРаспоряжений;
	ЗонаГруппаИлиПустая 		= НЕ ЗначениеЗаполнено(Зона) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Зона,"ЭтоГруппа");
	
	ВыборочноеОбновление = (ОбновляемыеРаспоряжения <> Неопределено);
	
	ВесОбъемРаспоряженийПоДатам = Новый ТаблицаЗначений;
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Вес", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Объем", ОбщегоНазначения.ОписаниеТипаЧисло(18,6));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	КешДобавляемыхСтрок = Новый Массив;
	
	КоллекцияРаспоряжений = РаспоряженияНаДоставку.ПолучитьЭлементы();
	ВесОбъем = Новый Структура;
	
	Если Не ВыборочноеОбновление Тогда
		ВесОбъем.Вставить("ИтогоВес", 0);
		ВесОбъем.Вставить("ИтогоОбъем",0);
		КоллекцияРаспоряжений.Очистить();
		ТоварыРаспоряженийКДоставке.Очистить();
	Иначе
		СтруктураПоиска = Новый Структура("Склад, Распоряжение");
		
		Для Каждого Стр Из ОбновляемыеРаспоряжения Цикл
			
			// При выборочном обновлении сначала нужно удалить строки обновляемых распоряжений,
			// для этого воспользуемся списком товаров по распоряжениям.
			ПредыдущийИдентификатор = Неопределено;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Стр);
			
			НайденныеСтроки = ТоварыРаспоряженийКДоставке.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаТовары Из НайденныеСтроки Цикл
				Идентификатор = СтрокаТовары.ИдентификаторВДеревеРаспоряжений;
				Если ПредыдущийИдентификатор = Идентификатор
					Или Не ЗначениеЗаполнено(Идентификатор) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаРаспоряжение = РаспоряженияНаДоставку.НайтиПоИдентификатору(Идентификатор);
				Если СтрокаРаспоряжение <> Неопределено Тогда
					Если ЗонаГруппаИлиПустая Тогда
						ТекущаяВетка = СтрокаРаспоряжение.ПолучитьРодителя();
						КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
						// Если удаляем последний элемент в ветке, удалим родителя.
						Если КоллекцияТекущаяВетка.Количество() = 1 Тогда
							КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
						Иначе
							ТекущаяВетка.Вес = ТекущаяВетка.Вес - СтрокаРаспоряжение.Вес;
							ТекущаяВетка.Объем = ТекущаяВетка.Объем - СтрокаРаспоряжение.Объем;
							КоллекцияТекущаяВетка.Удалить(СтрокаРаспоряжение);
						КонецЕсли;
					Иначе
						КоллекцияРаспоряжений.Удалить(СтрокаРаспоряжение);
					КонецЕсли;
				КонецЕсли;
				ТоварыРаспоряженийКДоставке.Удалить(СтрокаТовары);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураЗадание = Новый Структура("ЗаданиеНаПеревозку", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураЗадание, Форма);
	
	Запрос = Новый Запрос;
	ИсходящаяДоставка = Форма.ВидДоставки = Перечисления.ВидыДоставки.СоСклада;
	
	ЕстьОрдерныйНаОтгрузкуСклад      = Ложь;
	ЕстьНеОрдерныйНаОтгрузкуСклад    = Ложь;
	ЕстьОрдерныйНаПоступлениеСклад   = Ложь;
	ЕстьНеОрдерныйНаПоступлениеСклад = Ложь;
	
	Если ИсходящаяДоставка Тогда
		ЕстьОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьОрдерныйНаОтгрузкуСклад(Склад);
		ЕстьНеОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьНеОрдерныйНаОтгрузкуСклад(Склад);
	Иначе
		ЕстьОрдерныйНаПоступлениеСклад = СкладыСервер.ЕстьОрдерныйНаПоступлениеСклад(Склад);
		ЕстьНеОрдерныйНаПоступлениеСклад = СкладыСервер.ЕстьНеОрдерныйНаПоступлениеСклад(Склад);
	КонецЕсли;
	
	ТекстЗапроса = "";
	Если ИсходящаяДоставка Тогда
		
		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
			ЕстьОрдерныйНаОтгрузкуСклад,
			ЕстьНеОрдерныйНаОтгрузкуСклад,
			Истина);
		
		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиКПолучателю", СпособыДоставкиНашимиСиламиКПолучателю());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомКПолучателю", СпособыДоставкиПеревозчикомКПолучателю());
		
	Иначе
		
		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
			ЕстьОрдерныйНаПоступлениеСклад,
			ЕстьНеОрдерныйНаПоступлениеСклад,
			Ложь);
		
		Запрос.УстановитьПараметр("ДатаОтбора", НачалоДня(ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиОтОтправителя", СпособыДоставкиНашимиСиламиОтОтправителя());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомОтОтправителя", СпособыДоставкиПеревозчикомОтОтправителя());
	
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	БезОтбораПоЗоне = Зона = Справочники.ЗоныДоставки.ПустаяСсылка();
	
	Запрос.УстановитьПараметр("Зона",                              Зона);
	Запрос.УстановитьПараметр("Склад",                             Склад);
	Запрос.УстановитьПараметр("БезОтбораПоЗоне",                   БезОтбораПоЗоне);
	Запрос.УстановитьПараметр("ОбновляемыеРаспоряжения",           ОбновляемыеРаспоряжения);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПодбор",          СтруктураЗадание.ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПустаяСсылка",    Документы.ЗаданиеНаПеревозку.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусЗаданияЗакрыто",              Перечисления.СтатусыЗаданийНаПеревозку.Закрыто);
	Запрос.УстановитьПараметр("ОтборПоТипуИсполнителей",           ОтборПоТипуИсполнителей);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса",                 ТекущаяДатаСеанса());
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДвиженияКРаспределению = Пакет[Пакет.ВГраница()-1].Выгрузить();
	
	ПоляОтбораДвижений = Новый Массив();
	ПоляОтбораДвижений.Добавить("Распоряжение");
	ПоляОтбораДвижений.Добавить("Склад");
	ПоляОтбораДвижений.Добавить("Номенклатура");
	ПоляОтбораДвижений.Добавить("Характеристика");
	ПоляОтбораДвижений.Добавить("Назначение");
	Если ДвиженияКРаспределению.Колонки.Найти("Серия") <> Неопределено Тогда
		ПоляОтбораДвижений.Добавить("Серия");
	КонецЕсли;
	ПоляОтбораДвиженийКРаспределению = СтрСоединить(ПоляОтбораДвижений, ",");
	
	Если ИсходящаяДоставка
		Или ЕстьОрдерныйНаПоступлениеСклад Тогда
		ДвиженияКРаспределению.Индексы.Добавить(ПоляОтбораДвиженийКРаспределению);
	КонецЕсли;
	
	Выборка = Пакет[Пакет.ВГраница()].Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Зона") Цикл
		
		Если ВыборочноеОбновление Тогда
			
		ИначеЕсли ЗонаГруппаИлиПустая Тогда
			ТекущаяВетка = КоллекцияРаспоряжений.Добавить();
			ТекущаяВетка.Адрес = Строка(Выборка.Зона);
			ТекущаяВетка.Зона = Выборка.Зона;
			КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
		Иначе
			КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
		КонецЕсли;
		
		ВесПоЗоне = 0;
		ОбъемПоЗоне = 0;
		
		Пока Выборка.СледующийПоЗначениюПоля("Распоряжение") Цикл
			
			Если ВыборочноеОбновление Тогда
				СтруктураЗонаАдрес = Новый Структура("Зона, Адрес");
				ЗаполнитьЗначенияСвойств(СтруктураЗонаАдрес, Выборка);
				ПозицияДляВставки = ПолучитьПозициюДляВставки(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая, СтруктураЗонаАдрес);
				Если ЗонаГруппаИлиПустая Тогда
					ТекущаяВетка = КоллекцияРаспоряжений[ПозицияДляВставки.Зона];
					КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
				Иначе
					КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
				КонецЕсли;
				ПозицияДляВставки = ПозицияДляВставки.Распоряжение;
			КонецЕсли;
			
			// Зинаков 10.08.2025 - 07.12.2025 Рекламации
			// 20.04.2026 ЗаказНаВнутреннееПотребление

			Если Выборка.ВидРаспоряжения = Тип("ДокументСсылка.ПоручениеЭкспедитору")
				ИЛИ Выборка.ВидРаспоряжения = Тип("ДокументСсылка.Рекламация")
				ИЛИ Выборка.ВидРаспоряжения = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
				
				Если ЗначениеЗаполнено(ДатаРаспоряжений)
					И ЗначениеЗаполнено(Выборка.Дата)
					И НачалоДня(Выборка.Дата) > ДатаРаспоряжений Тогда
					Продолжить;
				КонецЕсли;
				
				Если ВыборочноеОбновление Тогда
					СтрокаРаспоряжение = КоллекцияТекущаяВетка.Вставить(ПозицияДляВставки);
					ПозицияДляВставки = ПозицияДляВставки + 1;
				Иначе
					СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);
				СтрокаРаспоряжение.ПолучательОтправительПредставление = Выборка.ПолучательОтправитель;
				СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(Выборка.ВремяС, Выборка.ВремяПо);
				
				Если Выборка.ВидРаспоряжения = Тип("ДокументСсылка.Рекламация") Тогда
					ИтогоВес = 0;
					ИтогоОбъем = 0;
					Для каждого Т Из СтрокаРаспоряжение.Распоряжение.Комплектующие Цикл
						ВесОбъемЕдиницы = ОД_ОбщиеФункции.ПолучитьВесОбъем(Т.Номенклатура);
						Если ЗначениеЗаполнено(Т.Количество) Тогда
							ИтогоВес = ИтогоВес + ВесОбъемЕдиницы.Вес * Т.Количество;
							ИтогоОбъем = ИтогоОбъем + ВесОбъемЕдиницы.Объем * Т.Количество;
						КонецЕсли;
					КонецЦикла;
	                СтрокаРаспоряжение.Вес = ИтогоВес;
	                СтрокаРаспоряжение.Объем = ИтогоОбъем;
				КонецЕсли;
				
				Если Выборка.ВидРаспоряжения = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
					ИтогоВес = 0;
					ИтогоОбъем = 0;
					Для каждого Т Из СтрокаРаспоряжение.Распоряжение.Товары Цикл
						ВесОбъемЕдиницы = ОД_ОбщиеФункции.ПолучитьВесОбъем(Т.Номенклатура);
						Если ЗначениеЗаполнено(Т.Количество) Тогда
							ИтогоВес = ИтогоВес + ВесОбъемЕдиницы.Вес * Т.Количество;
							ИтогоОбъем = ИтогоОбъем + ВесОбъемЕдиницы.Объем * Т.Количество;
						КонецЕсли;
					КонецЦикла;
	                СтрокаРаспоряжение.Вес = ИтогоВес;
	                СтрокаРаспоряжение.Объем = ИтогоОбъем;
				КонецЕсли;

				СтрокаДляХраненияИдентификатора = ТоварыРаспоряженийКДоставке.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДляХраненияИдентификатора, Выборка);
				СтрокаДляХраненияИдентификатора.ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();
				
				Продолжить;
				
			КонецЕсли;

			Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл
				
				Номенклатура   = Неопределено;
				Характеристика = Неопределено;
				Назначение     = Неопределено;
				Серия          = Неопределено;
				
				ВесОбъемРаспоряженийПоДатам.Очистить();
				КешДобавляемыхСтрок.Очистить();
				ПотребностьПоТовару = 0;
				ПроверитьОтклонение = Ложь;
				
				Пока Выборка.Следующий() Цикл
					
					Если Номенклатура      <> Выборка.Номенклатура
						Или Характеристика <> Выборка.Характеристика
						Или Назначение     <> Выборка.Назначение
						Или Серия          <> Выборка.Серия Тогда
						// перешли к другому товару
						
						Номенклатура   = Выборка.Номенклатура;
						Характеристика = Выборка.Характеристика;
						Назначение     = Выборка.Назначение;
						Серия          = Выборка.Серия;
						
						Если ПроверитьОтклонение Тогда
							ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
							// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
							Для Каждого Стр Из КешДобавляемыхСтрок Цикл
								Если Стр.Количество <= ДопустимоеОтклонение Тогда
									ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						КешДобавляемыхСтрок.Очистить();
						ПотребностьПоТовару = 0;
						
						ПроверитьОтклонение = Выборка.МернаяЕдиницаИзмерения И ДопустимоеОтклонениеПроцент > 0;
						
					КонецЕсли;
					
					Если ИсходящаяДоставка Тогда
						
						ОсталосьРаспределить = Выборка.Количество;
						
						ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
						ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
						ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
						Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
							Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
							СтрокаДетальныхДанных.Количество = СтрокаДетальныхДанных.Количество - Списываем;
							
							Если ОсталосьРаспределить = 0 Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ОсталосьРаспределить > 0 Тогда
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
							ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
							ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить * (Выборка.Вес / Выборка.Количество);
							ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить * (Выборка.Объем / Выборка.Количество);
							
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							ПотребностьПоТовару = ПотребностьПоТовару + ОсталосьРаспределить;
						КонецЕсли;
						
					ИначеЕсли Не ЕстьОрдерныйНаПоступлениеСклад Тогда
						
						ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
						ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
						КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
						ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
						
					Иначе
						
						ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
						ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
						ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
						
						ОсталосьРаспределить = Выборка.Количество;
						// Распределение товаров по датам поступления;
						Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
							
							Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
							
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
							ТекущаяСтрокаВесОбъем.Дата = СтрокаДетальныхДанных.Период;
							ТекущаяСтрокаВесОбъем.Количество = Списываем;
							ТекущаяСтрокаВесОбъем.Вес = Списываем * СтрокаДетальныхДанных.Вес / СтрокаДетальныхДанных.Количество;
							ТекущаяСтрокаВесОбъем.Объем = Списываем * СтрокаДетальныхДанных.Объем / СтрокаДетальныхДанных.Количество;
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							
							Если ОсталосьРаспределить <= 0 Тогда
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
						Если ОсталосьРаспределить > 0 Тогда
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
							ТекущаяСтрокаВесОбъем.Дата = НачалоДня(ТекущаяДатаСеанса());
							ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
							ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить 	* Выборка.Вес 	/ Выборка.Количество;
							ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить 	* Выборка.Объем / Выборка.Количество;
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
						КонецЕсли;
						ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
					КонецЕсли;
				КонецЦикла;
				
				// Нужно проверить последний добавленный товар распоряжения;
				Если ПроверитьОтклонение Тогда
					ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
					// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
					Для Каждого Стр Из КешДобавляемыхСтрок Цикл
						Если Стр.Количество <= ДопустимоеОтклонение Тогда
							ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				ВесОбъемРаспоряженийПоДатам.Сортировать("Дата");
				
				ТекущаяДата = Неопределено;
				
				Для Каждого СтрокаВесОбъемДата Из ВесОбъемРаспоряженийПоДатам Цикл
					
					Если ЗначениеЗаполнено(ДатаРаспоряжений)
						И СтрокаВесОбъемДата.Дата > ДатаРаспоряжений Тогда
						Прервать;
					КонецЕсли;
					
					СтрокаТовар = ТоварыРаспоряженийКДоставке.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТовар, Выборка);
					ЗаполнитьЗначенияСвойств(СтрокаТовар, СтрокаВесОбъемДата);
					
					Если ТекущаяДата <> СтрокаВесОбъемДата.Дата Тогда
						
						ТекущаяДата = СтрокаВесОбъемДата.Дата;
						
						Если ВыборочноеОбновление Тогда
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Вставить(ПозицияДляВставки);
							ПозицияДляВставки = ПозицияДляВставки + 1;
						Иначе
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);
						
						Если СтрокаРаспоряжение.Свойство("АдресДоставкиЗначенияПолей") Тогда
							СтрокаРаспоряжение.АдресДоставкиЗначенияПолей = Выборка.АдресЗначенияПолей;
						КонецЕсли;
						
						СтрокаРаспоряжение.Дата = ТекущаяДата;
						СтрокаРаспоряжение.Вес = 0;
						СтрокаРаспоряжение.Объем = 0;
						
						СтрокаРаспоряжение.ПолучательОтправительПредставление = ДоставкаТоваровКлиентСервер.ПредставлениеПолучателяОтправителя(Выборка.ПолучательОтправитель, Выборка.Перевозчик, Форма.ВидДоставки);
						СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(Выборка.ВремяС, Выборка.ВремяПо);
						
						ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();
						
					КонецЕсли;
					
					СтрокаТовар.ИдентификаторВДеревеРаспоряжений = ИдентификаторВДеревеРаспоряжений;
					
					СтрокаРаспоряжение.Вес = СтрокаРаспоряжение.Вес + СтрокаВесОбъемДата.Вес;
					СтрокаРаспоряжение.Объем = СтрокаРаспоряжение.Объем + СтрокаВесОбъемДата.Объем;
					
					ВесПоЗоне   = ВесПоЗоне   + СтрокаВесОбъемДата.Вес;
					ОбъемПоЗоне = ОбъемПоЗоне + СтрокаВесОбъемДата.Объем;
					
				КонецЦикла;
				
			КонецЦикла; // Склад
		КонецЦикла; // Распоряжение
		
		Если Не ВыборочноеОбновление Тогда
			ВесОбъем.ИтогоВес = ВесОбъем.ИтогоВес + ВесПоЗоне;
			ВесОбъем.ИтогоОбъем = ВесОбъем.ИтогоОбъем  + ОбъемПоЗоне;
		КонецЕсли;
		
		Если ЗонаГруппаИлиПустая Тогда
			
			Если КоллекцияТекущаяВетка.Количество() = 0 Тогда
				КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
			Иначе
				Если ВыборочноеОбновление Тогда
					ТекущаяВетка.Вес   = ТекущаяВетка.Вес + ВесПоЗоне;
					ТекущаяВетка.Объем = ТекущаяВетка.Объем + ОбъемПоЗоне;
				Иначе
					ТекущаяВетка.Вес   = ВесПоЗоне;
					ТекущаяВетка.Объем = ОбъемПоЗоне;
				КонецЕсли;
				ТекущаяВетка.ОформлениеСтроки = 5;
				ТекущаяВетка.Зона = Выборка.Зона;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла; // Зона
	
	Если Не ИсходящаяДоставка Тогда
		
		ТЗ_ВесОбъем = Новый ТаблицаЗначений;
		ТЗ_ВесОбъем.Колонки.Добавить("Зона", Новый ОписаниеТипов("СправочникСсылка.ЗоныДоставки")); 
		ТЗ_ВесОбъем.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число")); 
		ТЗ_ВесОбъем.Колонки.Добавить("Объем", Новый ОписаниеТипов("Число")); 
		
		МассивЗаявкаНаВозврат = ПолучитьЗаявкиНаВозвратТоваровОтКлиента(Склад, ДатаРаспоряжений);
		КоллекцияКорневыхУзлов = РаспоряженияНаДоставку.ПолучитьЭлементы();
		Для каждого ЗаявкаНаВозврат Из МассивЗаявкаНаВозврат Цикл
			Если ЗонаСуществует(ЗаявкаНаВозврат.Зона, КоллекцияКорневыхУзлов) Тогда
				Продолжить;
			КонецЕсли;
			НовыйУзел = КоллекцияКорневыхУзлов.Добавить();
			НовыйУзел.Зона = ЗаявкаНаВозврат.Зона;
			НовыйУзел.Адрес = ЗаявкаНаВозврат.Зона;
			НовыйУзел.Картинка = 1;
			НовыйУзел.ОформлениеСтроки = 5;
		КонецЦикла;

		Для каждого УзелЗона Из КоллекцияКорневыхУзлов Цикл
			Для каждого ЗаявкаНаВозврат Из МассивЗаявкаНаВозврат Цикл
				Если УзелЗона.Зона = ЗаявкаНаВозврат.Зона Тогда
					Если СтрокаСуществует(ЗаявкаНаВозврат.Распоряжение, УзелЗона.ПолучитьЭлементы()) Тогда
						Продолжить;
					КонецЕсли;
					ТекущаяВетка = УзелЗона.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(ТекущаяВетка, ЗаявкаНаВозврат);
					ТекущаяВетка.Картинка = 1;
					
					СтрокаТЗ = ТЗ_ВесОбъем.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, ЗаявкаНаВозврат);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Форма, ВесОбъем);
	ЗаполнитьПризнакиОформленияРаспоряжений(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая);

	Для каждого ЭлементЗона Из РаспоряженияНаДоставку.ПолучитьЭлементы() Цикл
		Для каждого РР Из ЭлементЗона.ПолучитьЭлементы() Цикл
			Если Не ПустаяСтрока(РР.Адрес) Тогда
				КА = ОД_Логистика.ПолучитьКонтактыИзАдреса(РР.Адрес);
				МассивКА = Новый Массив;
				Если НЕ ПустаяСтрока(КА.КонтактноеЛицо) Тогда
					МассивКА.Добавить(КА.КонтактноеЛицо);
				КонецЕсли;
				Если НЕ ПустаяСтрока(КА.Телефон) Тогда
					МассивКА.Добавить(КА.Телефон);
				КонецЕсли;
				КонтактыИзАдресаСтрока = СтрСоединить(МассивКА, " т.: ");
				РР.Контакты = КонтактыИзАдресаСтрока;
			КонецЕсли;
			
			РР.СуммаПоРаспоряжению = СуммаПоРаспоряжению(РР.Распоряжение); // 09.07.2026
		КонецЦикла;
		
		Если Не ИсходящаяДоставка Тогда
			СтрокиТЗ = ТЗ_ВесОбъем.НайтиСтроки(Новый Структура("Зона", ЭлементЗона.Зона));
			ВесПоЗоне = 0;
			ОбъемПоЗоне = 0;
			Для каждого СтрокаТЗ Из СтрокиТЗ Цикл
				ВесПоЗоне = ВесПоЗоне + СтрокаТЗ.Вес;
				ОбъемПоЗоне = ОбъемПоЗоне + СтрокаТЗ.Объем;
			КонецЦикла;
			ЭлементЗона.Вес = ВесПоЗоне;
			ЭлементЗона.Объем = ОбъемПоЗоне;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&Вместо("ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя")
Процедура ОД_ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, ДокОбъект)

	УстановитьПривилегированныйРежим(Истина);
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект).Значение;
		
	Если Не ЗначениеЗаполнено(ПолучательОтправитель) Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы);
		Возврат;
	КонецЕсли;
	
	
	СписокВыбора = Новый СписокЗначений;
	//ПоследниеРеквизитыДоставкиИзЗаданий = ПоследниеРеквизитыДоставкиИзЗаданий(ПолучательОтправитель);
	//Для Каждого Стр Из ПоследниеРеквизитыДоставкиИзЗаданий Цикл
	//	СтруктураВыбора = СтруктураВыбора();
	//	ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
	//	СписокВыбора.Добавить(СтруктураВыбора,Стр.АдресДоставки);
	//КонецЦикла;
	//
	//ПоследниеРеквизитыДоставкиИзРаспоряжений = ПоследниеРеквизитыДоставкиИзРаспоряжений(ДокОбъект.Ссылка, ПолучательОтправитель);
	//Для Каждого Стр Из ПоследниеРеквизитыДоставкиИзРаспоряжений Цикл
	//	НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
	//	Если НайденныйЭлементСЗ = Неопределено Тогда
	//		СтруктураВыбора = СтруктураВыбора();
	//		ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
	//		СписокВыбора.Добавить(СтруктураВыбора, Стр.АдресДоставки);
	//	Иначе
	//		ДозаполнитьПустыеСвойства(НайденныйЭлементСЗ.Значение, Стр);
	//	КонецЕсли;
	//КонецЦикла;
	
	Если (ТипЗнч(ПолучательОтправитель) <> Тип("СправочникСсылка.СтруктураПредприятия")
		И ТипЗнч(ПолучательОтправитель) <> Тип("Строка")) Тогда
		
		АдресаПолучателяИзКонтактнойИнформации = АдресаПолучателяИзКонтактнойИнформации(ПолучательОтправитель);
		Для Каждого Стр Из АдресаПолучателяИзКонтактнойИнформации Цикл
			НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
			Если НайденныйЭлементСЗ = Неопределено Тогда
				СтруктураВыбора = СтруктураВыбора();
				ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
				СписокВыбора.Добавить(СтруктураВыбора, Стр.Вид + ": " + Стр.АдресДоставки);
			Иначе
				ДозаполнитьПустыеСвойства(НайденныйЭлементСЗ.Значение, Стр);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭлементыФормы.Найти("АдресДоставкиСамовывоз") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставкиСамовывоз.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресДоставкиПолучателя") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставкиПолучателя.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресДоставкиПолучателя1") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставкиПолучателя1.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресДоставкиПолучателя2") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставкиПолучателя2.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресПоставщика") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресПоставщика.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресПункта") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресПункта.СписокВыбора, СписокВыбора);
	КонецЕсли;

КонецПроцедуры

&Вместо("ЗаполнитьСписокВыбораАдресовПеревозчика")
Процедура ОД_ЗаполнитьСписокВыбораАдресовПеревозчика(ЭлементыФормы, ДокОбъект)
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭлементыФормы.Найти("АдресДоставкиПеревозчика") <> Неопределено Тогда
		ИмяЭлементаАдрес = "АдресДоставкиПеревозчика";
	Иначе
		Возврат;
	КонецЕсли;
	
	ПеревозчикПартнер = ДокОбъект.ПеревозчикПартнер;
	
	Если Не ЗначениеЗаполнено(ПеревозчикПартнер) Тогда
		ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект).Значение;
	АдресаПолучателяИзКонтактнойИнформации = АдресаПолучателяИзКонтактнойИнформации_ТолькоСпр(ПеревозчикПартнер);
	Для Каждого Стр Из АдресаПолучателяИзКонтактнойИнформации Цикл
		НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
		Если НайденныйЭлементСЗ = Неопределено Тогда
			СтруктураВыбора = СтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
			СписокВыбора.Добавить(СтруктураВыбора, Стр.Вид + ": " + Стр.АдресДоставки);
		ИначеЕсли Не ЗначениеЗаполнено(НайденныйЭлементСЗ.Значение.АдресДоставкиЗначенияПолей) Тогда
			НайденныйЭлементСЗ.Значение.АдресДоставкиЗначенияПолей = Стр.АдресДоставкиЗначенияПолей;
		КонецЕсли;
	КонецЦикла;
	
	СкопироватьСписокЗначений(ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора, СписокВыбора)

КонецПроцедуры

&Вместо("АдресаПолучателяИзКонтактнойИнформации")
Функция ОД_АдресаПолучателяИзКонтактнойИнформации(ПолучательОтправитель)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник." + ПолучательОтправитель.Метаданные().Имя + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяИнформацияПоДоставке КАК РС_ДополнительнаяИнформация
		|		ПО КонтактнаяИнформация.Представление = РС_ДополнительнаяИнформация.АдресДоставки
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И НЕ ЕСТЬNULL(РС_ДополнительнаяИнформация.НеАктуален, ЛОЖЬ)");
		
	Запрос.УстановитьПараметр("ПолучательОтправитель", ПолучательОтправитель);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции

Функция АдресаПолучателяИзКонтактнойИнформации_ТолькоСпр(ПолучательОтправитель)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник." + ПолучательОтправитель.Метаданные().Имя + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)");
		
	Запрос.УстановитьПараметр("ПолучательОтправитель", ПолучательОтправитель);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция СуммаПоРаспоряжению(п_Распоряжение)
	
     Если ТипЗнч(п_Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
	 	Возврат п_Распоряжение.СуммаДокумента;
	 КонецЕсли;

КонецФункции // ()

// 14.07.2026
&Вместо("ЗаполнитьРеквизитыПоСпособуДоставки")
Процедура ОД_ЗаполнитьРеквизитыПоСпособуДоставки(ЭлементыФормы, ДокОбъект, ДопИнфоИзмененоПользователем)
	
	ПустыеРеквизиты = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(ДокОбъект);
	ЗаполнитьЗначенияСвойств(ДокОбъект, ПустыеРеквизиты,
		"АдресДоставкиПеревозчика, АдресДоставкиПеревозчикаЗначенияПолей, ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо");
	
	Если Не ДопИнфоИзмененоПользователем Тогда
		ДокОбъект.ДополнительнаяИнформацияПоДоставке = "";
	КонецЕсли;
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект);
	
	//Если ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика
	//	Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
	//	Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада
	//	Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи Тогда
	//		
	//	Если ЭлементыФормы.Найти("ПеревозчикПартнер") <> Неопределено
	//		И ЭлементыФормы.ПеревозчикПартнер.СписокВыбора.Количество() > 0
	//		И ДокОбъект.ПеревозчикПартнер = Справочники.Партнеры.ПустаяСсылка() Тогда
	//		ДокОбъект.ПеревозчикПартнер = ЭлементыФормы.ПеревозчикПартнер.СписокВыбора[0].Значение;
	//	КонецЕсли;
	//	
	//Иначе
		
		ДокОбъект.ПеревозчикПартнер = Справочники.Партнеры.ПустаяСсылка();
		
	//КонецЕсли;
	
	ИмяЭлементаАдрес = ИмяЭлементаАдрес(ЭлементыФормы);
	
	Если ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика Тогда
		
		Если Не ДопИнфоИзмененоПользователем Тогда
			
			Если ЗначениеЗаполнено(ДокОбъект.АдресДоставки) Тогда
				НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора,
					"АдресДоставки", ДокОбъект.АдресДоставки);
				Если Не НайденныйЭлементСЗ = Неопределено Тогда
					ДокОбъект.ДополнительнаяИнформацияПоДоставке = НайденныйЭлементСЗ.Значение.ДополнительнаяИнформацияПоДоставке;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте Тогда
		
		Если ЗначениеЗаполнено(ДокОбъект.АдресДоставки) Тогда
			НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора,
				"АдресДоставки", ДокОбъект.АдресДоставки);
			Если Не НайденныйЭлементСЗ = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ДокОбъект, НайденныйЭлементСЗ.Значение,
					"ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо")
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки Тогда
		
		Если ЭлементыФормы.АдресПоставщика.СписокВыбора.Количество() > 0 Тогда
			ПерваяСтруктураВСписке = ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора[0].Значение;
			ЗаполнитьЗначенияСвойств(ДокОбъект,ПерваяСтруктураВСписке,,"ДополнительнаяИнформацияПоДоставке");
			Если Не ДопИнфоИзмененоПользователем Тогда
				ДокОбъект.ДополнительнаяИнформацияПоДоставке = ПерваяСтруктураВСписке.ДополнительнаяИнформацияПоДоставке;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Не ЗначениеЗаполнено(ДокОбъект.СпособДоставки)
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада Тогда
		
		ДокОбъект.ДополнительнаяИнформацияПоДоставке = "";
		ДокОбъект.ОсобыеУсловияПеревозки = Ложь;
		ДокОбъект.ОсобыеУсловияПеревозкиОписание = "";
		
	КонецЕсли;

КонецПроцедуры
